# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
url = "https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv"
baby_names = pd.read_csv(url)

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
baby_names = baby_names.drop(['Unnamed: 0', 'Id'], axis=1)

In [5]:
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [6]:
baby_names.groupby('Gender').Name.count()
# baby_names.Gender.value_counts()
# There are more female names in the dataset

Gender
F    558846
M    457549
Name: Name, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [7]:
names = baby_names.groupby('Name').agg({'Count':'sum'})

In [8]:
names.head()

         Count
Name
Aaban       12
Aadan       23
Aadarsh      5
Aaden     3426
Aadhav       6

### Step 8. How many different names exist in the dataset?

In [9]:
baby_names.Name.nunique()

17632

### Step 9. What is the name with most occurrences?

In [10]:
names.sort_values('Count', ascending=False).head(1)

        Count
Name
Jacob  242874

### Step 10. How many different names have the least occurrences?

In [11]:
names.sort_values('Count', ascending=False).tail()

            Count
Name
Eniola          5
Atlantis        5
Marci           5
Simarpreet      5
Nita            5

In [12]:
len(names[names['Count'] == 5])

2578

### Step 11. What is the median name occurrence?

In [13]:
names.Count.median()
# names[names.Count == names.Count.median()]

49.0

### Step 12. What is the standard deviation of names?

In [14]:
names.Count.std()

11006.06946789057

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [15]:
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000

In [16]:
baby_names.describe(include='all')

           Name          Year   Gender    State         Count
count   1016395  1.016395e+06  1016395  1016395  1.016395e+06
unique    17632           NaN        2       51           NaN
top       Riley           NaN        F       CA           NaN
freq       1112           NaN   558846    76781           NaN
mean        NaN  2.009053e+03      NaN      NaN  3.485012e+01
std         NaN  3.138293e+00      NaN      NaN  9.739735e+01
min         NaN  2.004000e+03      NaN      NaN  5.000000e+00
25%         NaN  2.006000e+03      NaN      NaN  7.000000e+00
50%         NaN  2.009000e+03      NaN      NaN  1.100000e+01
75%         NaN  2.012000e+03      NaN      NaN  2.600000e+01
max         NaN  2.014000e+03      NaN      NaN  4.167000e+03